import { AdmitStatus, UniversitiesMap } from "@/types/admit";

export const HOWTO_URL = "https://charm-count-364.notion.site/2aa47bd4842d80bea0d4d78f64d99a0a";

export const BRANCHES = [
  "강남", "강북", "광명", "광주남구", "광주동구", "광주북구", "광주수완", "구리남양주", "김포", "노량진",
  "대구달서", "대구수성1관", "대구수성2관", "대전둔산", "독학기숙", "동탄", "마포", "목동", "목동오목교", "목포",
  "부산교대", "부산대", "부산북구", "부산서면", "부산해운대", "부천", "분당정자", "서울강동", "서울강서", "서울광진",
  "서울대", "서울도봉", "서울성동", "서울성북", "서울송파", "수원시청", "수원영통", "수원정자", "안산", "안성기숙",
  "용인수지", "울산남구", "원주", "은평서대문", "의정부", "이천기숙", "익산", "인천부평", "인천송도", "인천청라",
  "일산동구", "일산서구", "일산화정", "제주", "진주", "창원", "천안", "청주", "춘천", "파주", "평택", "하남"
];

export const INIT_UNIVERSITIES: UniversitiesMap = {
  "서울대학교": { code: "A", depts: { "자유전공학부": "000", "학부대학(광역)": "000", "경영대학": "000", "경제학부": "000", "국어교육과": "000", "농경제사회학부": "000", "사회교육과": "000", "사회학과": "000", "소비자아동학부-소비자학": "000", "소비자아동학부-아동가족학": "000", "심리학과": "000", "언론정보학과": "000", "역사교육과": "000", "역사학부": "000", "영어교육과": "000", "윤리교육과": "000", "인문계열": "000", "정치외교학부": "000", "지리교육과": "000", "지리학과": "000", "간호대학": "000", "건설환경공학부": "000", "건축학과": "000","기계공학부": "000", "물리교육과": "000", "물리천문학부-물리학": "000", "물리천문학부-천문학": "000", "바이오시스템소재학부": "000", "산림과학부": "000", "산업공학과": "000", "생명과학부": "000", "생물교육과": "000", "수리과학부": "000", "수의예과": "100", "수학교육과": "000", "스마트시스템과학과": "000", "식물생산과학부": "000", "식품동물생명공학부": "000", "식품영양학과": "000", "약학계열": "100", "에너지자원공학과": "000","원자핵공학과": "000", "응용생물화학부": "000", "의류학과": "000", "의예과": "100", "재료공학부": "000", "전기정보공학부": "000", "조경지역시스템공학부": "000", "조선해양공학과": "000", "지구과학교육과": "000","지구환경과학부": "000", "첨단융합학부": "000", "치의학과(학석사통합과정)": "100", "컴퓨터공학부": "000", "통계학과": "000", "항공우주공학과": "000", "화학교육과": "000", "화학부": "000", "화학생물공학부": "000"} },
  "연세대학교": { code: "A", depts: { "간호학과": "000", "식품영양학과": "000", "실내건축학과": "000", "아동가족학과": "000", "의류환경학과": "000", "통합디자인학과": "000", "경영학과": "000", "경제학부": "000", "교육학부": "000", "국어국문학과": "000", "노어노문학과": "000", "독어독문학과": "000", "문헌정보학과": "000", "문화인류학과": "000", "불어불문학과": "000", "사학과": "000", "사회복지학과": "000", "사회학과": "000", "신학과": "000", "심리학과": "000", "언론홍보영상학부": "000", "영어영문학과": "000", "응용통계학과": "000","정치외교학과": "000", "중어중문학과": "000", "철학과": "000", "행정학과": "000", "IT융합공학전공": "000", "건축공학과": "000", "기계공학부": "000", "대기과학과": "000", "도시공학과": "000", "디스플레이융합공학과": "000", "물리학과": "000", "사회환경시스템공학부": "000", "산업공학과": "000", "생명공학과": "000", "생화학과": "000", "수학과": "000", "시스템반도체공학과": "000", "시스템생물학과": "000","신소재공학부": "000", "약학과": "100", "의예과": "100", "인공지능학과": "000", "전기전자공학부": "000", "지구시스템과학과": "000", "천문우주학과": "000", "치의예과": "100", "화공생명공학부": "000","화학과": "000", "언더우드학부(인문사회)": "000", "융합인문사회과학부(HASS)": "000", "융합과학공학부(ISE)": "000"} },
  "고려대학교": { code: "A", depts: { "경영대학": "000", "경제학과": "000", "교육학과": "000", "국어교육과": "000", "국어국문학과": "000","국제학부": "000", "노어노문학과": "000", "독어독문학과": "000", "미디어학부": "000", "보건정책관리학부": "000","불어불문학과": "000", "사학과": "000", "사회학과": "000", "서어서문학과": "000", "식품자원경제학과": "000","심리학부": "000", "언어학과": "000", "역사교육과": "000", "영어교육과": "000", "영어영문학과": "000","일어일문학과": "000", "자유전공학부": "000", "정치외교학과": "000", "중어중문학과": "000", "지리교육과": "000","철학과": "000", "통계학과": "000", "한국사학과": "000", "한문학과": "000", "행정학과": "000","가정교육과": "000", "간호대학": "000", "건축사회환경공학부": "000", "건축학과": "000", "기계공학부": "000","데이터과학과": "000", "물리학과": "000", "바이오시스템의과학부": "000", "바이오의공학부": "000", "보건환경융합과학부": "000","산업경영공학부": "000", "생명공학부": "000", "생명과학부": "000", "수학과": "000", "수학교육과": "000","스마트보안학부": "000", "식품공학과": "000", "신소재공학부": "000", "융합에너지공학과": "000", "의과대학": "100","인공지능학과": "000", "전기전자공학부": "000", "지구환경과학과": "000", "컴퓨터학과": "000", "화공생명공학과": "000","화학과": "000", "환경생태공학부": "000", "반도체공학과": "000", "사이버국방학과": "000", "스마트모빌리티학부": "000","차세대통신학과": "000"} },
};

export const STATUS_BAR_CLASS: Record<AdmitStatus, string> = {
  승인: "bg-emerald-500",
  반려: "bg-rose-500",
  대기중: "bg-amber-500",
};

export const SCHOOL_CODE_ORDER = ["A", "B", "E", "C", "D", "G", "F"];

export const UNIVERSITY_ORDER = [
  "서울대학교","연세대학교","고려대학교","서강대학교","성균관대학교","한양대학교","이화여자대학교","중앙대학교",
  "경희대학교","한국외국어대학교","서울시립대학교","건국대학교","동국대학교","홍익대학교","숙명여자대학교", "한양대학교(ERICA)",
  "국민대학교","숭실대학교","세종대학교","단국대학교","인하대학교","아주대학교","서울과학기술대학교",
  "한국항공대학교","광운대학교","명지대학교","상명대학교","가톨릭대학교","성신여자대학교","가천대학교",
  "경기대학교","서울여자대학교","동덕여자대학교","덕성여자대학교","한성대학교","서경대학교","삼육대학교",
];

export const RULE1_SCHOOLS = ["서울대학교","연세대학교","성균관대학교","가톨릭대학교","울산대학교"];
export const RULE2_DEPTS = ["의예과","의학과(의예과)","의학과","의과대학","의예","의학부"];
export const RULE3_DEPTS = ["치의예과","치의학전문대학원학석사통합과정","치의학과","치의예과(자연)","치의예과(인문)","치의학전문대학원(학석사통합)"];
export const RULE4_DEPTS = ["한의예과","한의예과(인문)","한의예과(자연)","한의학전문대학원학석사통합과정"];
export const RULE5_DEPTS = ["약학과","약학부","약학대학","약학계열","약학","약학부-약학","약학부-미래산업약학","제약학과"];
export const RULE6_DEPTS = ["수의예과"];
