import { PrismaClient } from "@prisma/client";
const prisma = new PrismaClient();

const BRANCHES = [
  "강남","강북","광명","광주남구","광주동구","광주북구","광주수완","구리남양주","김포","노량진",
  "대구달서","대구수성1관","대구수성2관","대전둔산","독학기숙","동탄","마포","목동","목동오목교","목포",
  "부산교대","부산대","부산북구","부산서면","부산해운대","부천","분당정자","서울강동","서울강서","서울광진",
  "서울대","서울도봉","서울성동","서울성북","서울송파","수원시청","수원영통","수원정자","안산","안성기숙",
  "용인수지","울산남구","원주","은평서대문","의정부","이천기숙","익산","인천부평","인천송도","인천청라",
  "일산동구","일산서구","일산화정","제주","진주","창원","천안","청주","춘천","파주","평택","하남"
];

async function main() {
  for (const name of BRANCHES) {
    await prisma.branch.upsert({
      where: { name },
      update: {},
      create: { name },
    });
  }
}

main().finally(()=>prisma.$disconnect());
